2026/ROSS_AAA/AAA_F_70-79_stat_2_prob_distribution_parabolic_morph_8/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (-43.224834 -25.454858 -61.243627)
    (79.738529 -25.454858 -61.243627)
    (79.738529 155.085256 -61.243627)
    (-43.224834 155.085256 -61.243627)
    (-43.224834 -25.454858 61.361643)
    (79.738529 -25.454858 61.361643)
    (79.738529 155.085256 61.361643)
    (-43.224834 155.085256 61.361643)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (246 362 246) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    world
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);
